{
  "_name_or_path": "microsoft/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "fax",
    "1": "marker_company_name",
    "2": "marker_fax",
    "3": "marker_bank_address",
    "4": "marker_company_address",
    "5": "represented_position",
    "6": "marker_account_number",
    "7": "account_number",
    "8": "marker_swift_code",
    "9": "marker_phone",
    "10": "company_address",
    "11": "marker_tax",
    "12": "represented_name",
    "13": "phone",
    "14": "swift_code",
    "15": "bank_name",
    "16": "company_name",
    "17": "text",
    "18": "bank_address",
    "19": "marker_represented_position",
    "20": "marker_bank_name",
    "21": "marker_represented_name",
    "22": "tax"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "account_number": 7,
    "bank_address": 18,
    "bank_name": 15,
    "company_address": 10,
    "company_name": 16,
    "fax": 0,
    "marker_account_number": 6,
    "marker_bank_address": 3,
    "marker_bank_name": 20,
    "marker_company_address": 4,
    "marker_company_name": 1,
    "marker_fax": 2,
    "marker_phone": 9,
    "marker_represented_name": 21,
    "marker_represented_position": 19,
    "marker_swift_code": 8,
    "marker_tax": 11,
    "phone": 13,
    "represented_name": 12,
    "represented_position": 5,
    "swift_code": 14,
    "tax": 22,
    "text": 17
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.27.3",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
